; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v2)
             (pred_12 ?v7 ?v8)
             (pred_4 ?v11 ?v8)
             (pred_3 ?v4 ?v11 )
	     (pred_1 ?v11)
             (pred_6 ?v9)
             (pred_5 ?v7)
             (pred_11 ?v8)
             (pred_8 ?v11)
             (pred_2 ?v7)
             (pred_7 ?v11)
             (pred_9 ))



(:action op_1
:parameters (?v1 ?v13 ?v10 ?v5)
:precondition (and (pred_6 ?v1) (pred_6 ?v13) (pred_5 ?v10) (pred_11 ?v5)
          (pred_10 ?v1 ?v13) (pred_12 ?v10 ?v5)
                   (pred_4 ?v13 ?v5) (pred_1 ?v1) 
                   (pred_8 ?v13) (pred_2 ?v10))
:effect (and  (pred_7 ?v13) (not (pred_8 ?v13))))


(:action op_4
:parameters (?v1 ?v6)
:precondition (and (pred_6 ?v1) (pred_6 ?v6)
               (pred_1 ?v1) (pred_10 ?v1 ?v6) (pred_7 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v1))))

(:action op_5
:parameters (?v1 ?v10)
:precondition (and (pred_6 ?v1) (pred_5 ?v10) 
                  (pred_1 ?v1) (pred_3 ?v10 ?v1) (pred_9 ))
:effect (and (pred_2 ?v10)
   (not (pred_3 ?v10 ?v1)) (not (pred_9 ))))


(:action op_2
:parameters (?v1 ?v12 ?v3)
:precondition (and (pred_6 ?v1) (pred_5 ?v12) (pred_5 ?v3)
                  (pred_1 ?v1) (pred_2 ?v3) (pred_3 ?v12 ?v1))
:effect (and (pred_2 ?v12) (pred_3 ?v3 ?v1)
        (not (pred_2 ?v3)) (not (pred_3 ?v12 ?v1))))

(:action op_3
:parameters (?v1 ?v10)
:precondition (and (pred_6 ?v1) (pred_5 ?v10) 
                  (pred_1 ?v1) (pred_2 ?v10))
:effect (and (pred_9 ) (pred_3 ?v10 ?v1) (not (pred_2 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_05 obj_17 obj_04 obj_03 obj_06 obj_11 obj_09 obj_16 obj_19 obj_12 obj_15 obj_02 obj_10 obj_07 obj_13
    obj_21 obj_18
    obj_20 obj_01 obj_08
    )

    (:init
       (pred_9)

       (pred_6 obj_14)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_09)
       (pred_6 obj_16)
       (pred_6 obj_19)
       (pred_6 obj_12)
       (pred_6 obj_15)
       (pred_6 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_5 obj_20)
       (pred_5 obj_01)
       (pred_5 obj_08)

       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_05)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_05 obj_14)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_17 obj_05)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_13 obj_07)
       (pred_8 obj_10)
       (pred_8 obj_16)
       (pred_8 obj_11)
       (pred_4  obj_10 obj_21)
       (pred_4  obj_16 obj_18)
       (pred_4  obj_11 obj_18)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_12)
       (pred_7 obj_15)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_13)

       (pred_12  obj_20 obj_21)
       (pred_12  obj_01 obj_18)
       (pred_12  obj_08 obj_21)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_08 obj_04)
       (pred_1 obj_05)
    )

    (:goal (and
       (pred_3 obj_20 obj_07)
       (pred_3 obj_01 obj_15)
    ))
(:constraints
  (always (not (pred_1 obj_12)))
)
)

; plan
1. (op_4 obj_05 obj_14)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_14)
   goals met: 0 of 2
2. (op_4 obj_14 obj_03)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_5 obj_03 obj_01)
   deleted: (pred_3 obj_01 obj_03) (pred_9)
   added: (pred_2 obj_01)
   goals met: 0 of 2
4. (op_4 obj_03 obj_06)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_06)
   goals met: 0 of 2
5. (op_1 obj_06 obj_11 obj_01 obj_18)
   deleted: (pred_8 obj_11)
   added: (pred_7 obj_11)
   goals met: 0 of 2
6. (op_4 obj_06 obj_11)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_11)
   goals met: 0 of 2
7. (op_4 obj_11 obj_09)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_09)
   goals met: 0 of 2
8. (op_4 obj_09 obj_15)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_15)
   goals met: 0 of 2
9. (op_3 obj_15 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_9) (pred_3 obj_01 obj_15)
   goals met: 1 of 2
10. (op_4 obj_15 obj_09)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_09)
   goals met: 1 of 2
11. (op_5 obj_09 obj_20)
   deleted: (pred_3 obj_20 obj_09) (pred_9)
   added: (pred_2 obj_20)
   goals met: 1 of 2
12. (op_4 obj_09 obj_15)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_15)
   goals met: 1 of 2
13. (op_4 obj_15 obj_13)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_13)
   goals met: 1 of 2
14. (op_4 obj_13 obj_07)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_07)
   goals met: 1 of 2
15. (op_3 obj_07 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_9) (pred_3 obj_20 obj_07)
   goals met: 2 of 2
